#include "bsp.h"

volatile unsigned char sending;

void bsp_InitSerial(void)
{
   SCON = 0X50 ;//0101 0000
   //控制定时器1 产生需要的波特率
   TMOD |= 0X20;//T1 处于工作模式2  自动重装载初始值
   //赋定时器的初始值 ，参考ppt中的表格
   TH1 = 0XFD;
   TL1 = 0XFD;
   TR1 = 1;
   EA = 1; //总的中断开关
   ES = 1; //串口的中断开关
}

void uart(void) interrupt 4		 //串口发送中断
{
 if(RI)    //收到数据
 {
  RI=0;   //清中断请求
 }
 else      //发送完一字节数据
 {
  TI=0;
  sending=0;  //清正在发送标志
 }
}

void UART1_SendByte(u8 dat)
{
   SBUF=dat; //将数据写入到串口缓冲
   sending=1;	 //设置发送标志
   while(sending); //等待发送完毕
}

/*********************************************************************************************
//函数名:Next_Play()
//
//功能说明:播放下一首
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Next_Play()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x03);
    UART1_SendByte(0xEF); 
}

/*********************************************************************************************
//函数名:Last_Play()
//
//功能说明:播放上一首
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Last_Play()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x04);
    UART1_SendByte(0xEF); 
}
/*********************************************************************************************
//函数名:Specify_Musi_Play()
//
//功能说明:指定曲目播放
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Specify_Musi_Play(u8 num)
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x04);
    UART1_SendByte(0x33);
    UART1_SendByte(0x00);
    UART1_SendByte(num);
    UART1_SendByte(0xEF); 
}

/*********************************************************************************************
//函数名:Volume_add()
//
//功能说明:音量加
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
/*void Volume_add()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x05);
    UART1_SendByte(0xEF); 
}*/
/*********************************************************************************************
//函数名:Volume_nec()
//
//功能说明:音量减
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
/*void Volume_nec()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x06);
    UART1_SendByte(0xEF); 
}*/
/*********************************************************************************************
//函数名:Specify_Volume()
//
//功能说明:指定音量
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Specify_Volume(u8 num)
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x03);
    UART1_SendByte(0x31);
    UART1_SendByte(num);
    UART1_SendByte(0xEF); 
}


/*********************************************************************************************
//函数名:Music_play()
//
//功能说明:播放(循环播放)
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Music_play()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x01);
    UART1_SendByte(0xEF); 
}
/*********************************************************************************************
//函数名:Music_pause()
//
//功能说明:暂停(再次发送指令继续播放)
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Music_pause()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x0C);
    UART1_SendByte(0xEF); 
}
/*********************************************************************************************
//函数名:Music_stop()
//
//功能说明:停止
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Music_stop()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x02);
    UART1_SendByte(0x0E);
    UART1_SendByte(0xEF); 
}
/*********************************************************************************************
//函数名:Cycle_play()
//
//功能说明:全部循环
//
//入口参数:
//
//出口参数:NO
***********************************************************************************************/
void Cycle_play()
{
    UART1_SendByte(0x7E); 
    UART1_SendByte(0x03);
    UART1_SendByte(0x33);
    UART1_SendByte(0x00);
    UART1_SendByte(0xEF); 
}